[
	{
		"client": "Legacy Partners",
		"slug": "Legacy Partners",
		"description": "Legacy Partners engaged Primary after a split from their commercial division. The objective was to focus on Legacy’s expertise in multifamily development, management, and acquisitions. The result was a rebrand, updated collateral package, executive photoshoot, and a responsive website complete with an interactive communities map.",
		"gallery": []
	},
	{
		"client": "Martha's Vineyard Dressing Co.",
		"slug": "MV Dressing Co.",
		"description": "Cape Cod salad dressing company, Chilmark Foods, approached Primary in need of rebranding, packaging design and digital marketing. Primary rebranded them as Martha's Vineyard Dressing Co. by developing a quirky, fun and approachable identity. Primary is currently building their responsive website and boosting brand awareness on social media. Pick up a bottle at any New England Whole Foods&#174;.",
		"gallery": []
	},
	{
		"client": "Related",
		"slug": "Related",
		"description": "Related hired Primary to develop lead-generating microsites for their premier condominium properties in Southern California, including penthouses at The Century (Los Angeles) and The Seychelle (Santa Monica). Compatible with every major OS, web browser, and mobile device, each website contains stunning photography and a user-friendly experience designed to connect Related's sales team with prospective buyers.",
		"gallery": []
	},
	{
		"client": "Avalon",
		"slug": "Avalon",
		"description": "Our firm designed the original Avalon Properties brand in 1992 and grew with them as a partner when they purchased Bay Communities in 1998 to become AvalonBay. Since then, we’ve helped Avalon grow into one of the nation’s most respected REITs. Today, we do it all for Avalon, including development websites, advertising campaigns, event planning, interior and exterior graphics, printed collateral, 3D floor plans, and email marketing.",
		"gallery": []
	},
	{
		"client": "CharterSearch",
		"slug": "CharterSearch",
		"description": "CharterSearch, a national air charter arrangement service, approached Primary in need of a fresh look to their marketing. Primary started with a brand makeover by developing a sleek new logo and compelling tagline, find your wings. Primary then extended the new brand and supporting visual language to a responsive website, trade show booth, brochure, pocket folder and stationary system.",
		"gallery": []
	},
	{
		"client": "SimplyBetter",
		"slug": "SimplyBetter",
		"description": "We created and executed the brand strategy for a growing national portfolio of Related Management’s mid-market apartment homes, SimplyBetter. We saw the rollout through until they were on autopilot.",
		"gallery": []
	},
	{
		"client": "AVA",
		"slug": "AVA",
		"description": "We played a vital role in the brand rollout of AVA, AvalonBay’s brand targeting Gen X and Millennials. We continue to work with AVA’s lease-up communities, running advertising campaigns, interior and exterior graphics, printed collateral, 3D floor plans, and email marketing.",
		"gallery": []
	},
	{
		"client": "BRE",
		"slug": "BRE",
		"description": "Primary was instrumental in the comprehensive brand work that was created for BRE Properties and many of its flagship communities in the 18 months prior to being acquired by Essex. A branded leasing office and fitness center experience was created and implemented for BRE’s new and redevelopment communities to provide a consistent customer experience.",
		"gallery": []
	},
	{
		"client": "Anyone Home",
		"slug": "Anyone Home",
		"description": "Single family home call center leaders, Anyone Home, came to Primary in need of a brochure. One brochure quickly turned into multiple brochures, a trade show booth, pop-up banners, advertising, and a direct mail campaign series to promote their entry into the multi-family market.",
		"gallery": []
	},
	{
		"client": "The Color Mint",
		"slug": "The Color Mint",
		"description": "Boutique women’s clothing store The Color Mint asked Primary to develop an eCommerce website to help drive sales nationally. Primary developed an easy-to-use online store and conducted several photoshoots to help create a brand image.",
		"gallery": []
	}
]